public class Main {
    public static void main(String[] args) {
        int ticket = 5000;
        int rubles_for_bonus = 20;
        int miles = ticket / rubles_for_bonus;
        System.out.println ("Количество миль равно =" + miles);
    // Объявляете переменные для входных данных и
    // параметров программы: одну для хранения
    // стоимости билета, другую для хранения количества
    // рублей для одной бонусной милли

    // Рассчитываете количество бонусных милль, используя
    // значения заведённых переменных. Ответ сохраняете в
    // новую переменную и выводит   е на экран
    }
}
